Microchip-MPLAB-Harmony/csp/apps/trustZone/trustZone_demo/trustZone_basic/NonSecure/firmware/src/packs/ATSAML11E16A_DFP/atsaml11e16a.h
/**
 * \brief Header file for ATSAML11E16A
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-02-04T13:16:43Z */
#ifndef _SAML11E16A_H_
#define _SAML11E16A_H_

// Header version uses Semantic Versioning 2.0.0 (https://semver.org/)
#define HEADER_FORMAT_VERSION "2.0.0"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (0)

/** \addtogroup SAML11E16A_definitions SAML11E16A definitions
  This file defines all structures and symbols for SAML11E16A:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_U_) || defined(_L_) || defined(_UL_)
#    error "Integer Literals macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#  define _U_(x) (x ## U)    /**< C code: Unsigned integer literal constant value */
#  define _L_(x) (x ## L)    /**< C code: Long integer literal constant value */
#  define _UL_(x) (x ## UL)  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#  define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#  define _L_(x) x    /**< Assembler: Long integer literal constant value */
#  define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAML11E16A                                         */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M23 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /**< -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /**< -13 Hard Fault, all classes of Fault    */
  SVCall_IRQn               =  -5, /**< -5  System Service Call via SVC instruction */
  PendSV_IRQn               =  -2, /**< -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /**< -1  System Tick Timer                   */
/******  SAML11E16A specific Interrupt Numbers ***********************************/
  OSC32KCTRL_IRQn           =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (OSC32KCTRL) */
  OSCCTRL_IRQn              =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (OSCCTRL) */
  MCLK_IRQn                 =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (MCLK) */
  SUPC_IRQn                 =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (SUPC) */
  PM_IRQn                   =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (PM) */
  WDT_IRQn                  =   1, /**< 1   Watchdog Timer (WDT)                */
  RTC_IRQn                  =   2, /**< 2   Real-Time Counter (RTC)             */
  EIC_EXTINT_0_IRQn         =   3, /**< 3   External Interrupt Controller (EIC) */
  EIC_EXTINT_1_IRQn         =   4, /**< 4   External Interrupt Controller (EIC) */
  EIC_EXTINT_2_IRQn         =   5, /**< 5   External Interrupt Controller (EIC) */
  EIC_EXTINT_3_IRQn         =   6, /**< 6   External Interrupt Controller (EIC) */
  EIC_OTHER_IRQn            =   7, /**< 7   External Interrupt Controller (EIC) */
  FREQM_IRQn                =   8, /**< 8   Frequency Meter (FREQM)             */
  NVMCTRL_IRQn              =   9, /**< 9   Non-Volatile Memory Controller (NVMCTRL) */
  PORT_IRQn                 =  10, /**< 10  Port Module (PORT)                  */
  DMAC_0_IRQn               =  11, /**< 11  Direct Memory Access Controller (DMAC) */
  DMAC_1_IRQn               =  12, /**< 12  Direct Memory Access Controller (DMAC) */
  DMAC_2_IRQn               =  13, /**< 13  Direct Memory Access Controller (DMAC) */
  DMAC_3_IRQn               =  14, /**< 14  Direct Memory Access Controller (DMAC) */
  DMAC_OTHER_IRQn           =  15, /**< 15  Direct Memory Access Controller (DMAC) */
  EVSYS_0_IRQn              =  16, /**< 16  Event System Interface (EVSYS)      */
  EVSYS_1_IRQn              =  17, /**< 17  Event System Interface (EVSYS)      */
  EVSYS_2_IRQn              =  18, /**< 18  Event System Interface (EVSYS)      */
  EVSYS_3_IRQn              =  19, /**< 19  Event System Interface (EVSYS)      */
  EVSYS_NSCHK_IRQn          =  20, /**< 20  Event System Interface (EVSYS)      */
  PAC_IRQn                  =  21, /**< 21  Peripheral Access Controller (PAC)  */
  SERCOM0_0_IRQn            =  22, /**< 22  Serial Communication Interface (SERCOM0) */
  SERCOM0_1_IRQn            =  23, /**< 23  Serial Communication Interface (SERCOM0) */
  SERCOM0_2_IRQn            =  24, /**< 24  Serial Communication Interface (SERCOM0) */
  SERCOM0_OTHER_IRQn        =  25, /**< 25  Serial Communication Interface (SERCOM0) */
  SERCOM1_0_IRQn            =  26, /**< 26  Serial Communication Interface (SERCOM1) */
  SERCOM1_1_IRQn            =  27, /**< 27  Serial Communication Interface (SERCOM1) */
  SERCOM1_2_IRQn            =  28, /**< 28  Serial Communication Interface (SERCOM1) */
  SERCOM1_OTHER_IRQn        =  29, /**< 29  Serial Communication Interface (SERCOM1) */
  SERCOM2_0_IRQn            =  30, /**< 30  Serial Communication Interface (SERCOM2) */
  SERCOM2_1_IRQn            =  31, /**< 31  Serial Communication Interface (SERCOM2) */
  SERCOM2_2_IRQn            =  32, /**< 32  Serial Communication Interface (SERCOM2) */
  SERCOM2_OTHER_IRQn        =  33, /**< 33  Serial Communication Interface (SERCOM2) */
  TC0_IRQn                  =  34, /**< 34  Basic Timer Counter (TC0)           */
  TC1_IRQn                  =  35, /**< 35  Basic Timer Counter (TC1)           */
  TC2_IRQn                  =  36, /**< 36  Basic Timer Counter (TC2)           */
  ADC_OTHER_IRQn            =  37, /**< 37  Analog Digital Converter (ADC)      */
  ADC_RESRDY_IRQn           =  38, /**< 38  Analog Digital Converter (ADC)      */
  AC_IRQn                   =  39, /**< 39  Analog Comparators (AC)             */
  DAC_UNDERRUN_A_IRQn       =  40, /**< 40  Digital Analog Converter (DAC)      */
  DAC_EMPTY_IRQn            =  41, /**< 41  Digital Analog Converter (DAC)      */
  PTC_IRQn                  =  42, /**< 42  Peripheral Touch Controller (PTC)   */
  TRNG_IRQn                 =  43, /**< 43  True Random Generator (TRNG)        */
  TRAM_IRQn                 =  44, /**< 44  TrustRAM (TRAM)                     */

  PERIPH_MAX_IRQn           =  44  /**< Max peripheral ID */
} IRQn_Type;
